resume/resume.org
#+STARTUP: indent
* 个人简历
** 基本信息
姓名:胡月恒\\
性别:男\\
学历:硕士(应届毕业生)\\
手机:13323833820\\
邮箱:palagend@163.com\\
出生年月:1990-10-09\\
专业:测试计量技术及仪器(嵌入式方向)\\
** 技能描述
*** Java
1. java语言基础:OOP思想,设计模式,文件IO,socket编程,多线程,JDBC,java反射机制;
2. web基础:http协议,servlet,jsp;
3. 使用过的框架:Spring,Hibernate,JPA;
4. 熟悉的开发工具:Atom,Eclipse,Tomcat,Jboss,Maven
*** Linux
1. 熟悉的发行版:红帽系列
2. 脚本编程:bash脚本编程
3. 编辑器:vim,emacs,atom
4. 编译工具:gcc
*** 数据库
1. 基础:SQL
2. MySQL(MariaDB):复杂查询,数据库备份,数据库范式
3. Oracle:oracle工作原理
*** 其他
1. Javascript,Python,Php;
2. jQuery,Angular,easyui;
3. Node.js;
4. Android
** 校内实践
1. 乒乓球赛;
2. 组织专业同学聚会;
3. 参加迎新晚会;
4. 踊跃参与入党积极分子培训班;
5. 在河南有线实习期间参与认证系统的维护和二次开发;
** 项目经验
*** 河南有线网络接入认证系统
*项目描述*:这是我实习期间接受的第一个工作任务,为认证系统添加radius认证功能.这是一个比较老的项目,用的是EJB和jboss技术,框架采用的是struts.\\
*项目经验*:第一次对旧项目做维护,感觉真的很棘手,因为之前并没有关注EJB和jboss,对struts这一过时的技术更是直接忽略;但是既然接手了任务,也只能
硬着头皮往前冲了.我先是花了一个晚上的时间恶补了EJB和jboss的知识,然后写了一些小demo练练手熟悉熟悉.等了解RMI的工作原理,jboss和tomcat之
间的关系之后,思路就清晰多了;接下来是阅读项目源码,理清逻辑结构(代码没有文档,真的很痛苦,花了不少时间).通过与业务人员的沟通,了解RADIUS认证的业务流程
,然后就是写代码了,根据OSS传过来的指令,对RADIUS数据库作相应的CRUD操作(小case).\\回过头来想想这整个过程,大多时间是用在学习消化新知识上面了
,而写代码本身并没有占用太多时间.这种经验,在课堂上肯定是学不来的.
*** 河南有线网络分销系统二期\\
*涉及的技术*:Spring, Hibernate, EasyUI, MySQL\\
*开发工具和平台*:MyEclipse, SVN, Atom\\
*项目描述*:这是一个web项目,与河南有线合作的各级代理分销商可以通过这个平台,给用户缴纳上网费\\
*项目经验*:说实话,这个项目的开发体验不好,正面经验不多,反面教训倒不少.首先是前期需求都还不确定的情况下,就要求马上开工,而且只给一个月的时间,要实现缴费,权限分配,产品宣传,报表打印,库存管理,界面还要美观大方,稳定可靠.希望开发完了马上上线,开发人员总共就两个.既要短平快,又要大而全,这倒还不算什么,与银行接口协议都还没谈好的情况下,就让我自己先定接口,程序先写着,说如果需求有变化,再改过来就是了(真的好无语).各部门之间扯皮,数据结构混乱,文档不全或几乎没有,有时候只能通过变量名揣测大概意思.进度还催得紧,一个月下来草草了事,后来又因为立项的矛盾而搁置了,整个过程开发体验不好.通过这次糟糕的开发体验,我意识到软件工程管理的重要性,如果管理不到位,开发工作几乎寸步难行.
*** 基于百度地图SDK的手机定位App\\
*涉及的技术*:Baidu LBS,Android,java\\
*开发工具和平台*:Android Studio,android手机\\
*项目描述*:这是我作毕业论文期间需要采集车辆行驶数据而编写的一个手机端定位数据采集App,功能比较简单,就是采集驾驶员行车时的定位数据并保存到本地文件中,供后期分析处理;\\
*项目收获*:本人主要学的是java,而安卓与java有着千丝万缕的亲缘关系,我也就尝试着做了一个android app.从android开发环境的搭建,到百度SDK的学习,从程序设计,在到app发布.整个过程都是自力更生,摸石头过河走过来的.虽然是半道出家搞android,但整个过程让我对android系统有了深入的了解.如果将来有转到android开发的需求应该不会太辛苦.\\
*** 博客发布系统 \\
//TODO
** 所获奖项或证书
高级软件工程师;
高级数据库管理工程师;
系统分析师;
英语六级;
全国大学生电子设计大赛一等奖;
研究生学业奖学金;
驾驶证;
优秀班干部;
** 兴趣爱好
捣鼓linux,看博客,读书,听歌,爱运动
** 自我评价
1. 自学能力强. 当我面对陌生的新技术时,不会束手无策,而是通过上网搜索或是翻阅书籍自主学习新知识;
 载检索信息的过程中注重检索技巧, 首先粗略搜索,逛逛论坛看看博客,获取感性上的认识;然后,逐步缩小搜索范围,阅读官方英语文档深入研究,直到get新技能.
//TODO
